IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
<module name="PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_pru0_0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_pru0_0" offset="0x8" width="32" description="">
		<bitfield id="MAC_PRU0_0" width="32" begin="31" end="0" resetval="0x0" description="MAC pru0 DA3:DA0 Used for SAV and DA match" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_pru0_1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_pru0_1" offset="0xC" width="32" description="">
		<bitfield id="MAC_PRU0_1" width="16" begin="15" end="0" resetval="0x0" description="MAC pru0 DA5:DA4 Used for SAV and DA match" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_pru1_0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_pru1_0" offset="0x10" width="32" description="">
		<bitfield id="MAC_PRU1_0" width="32" begin="31" end="0" resetval="0x0" description="MAC pru1 DA3:DA0 Used for SAV and DA match" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_pru1_1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_pru1_1" offset="0x14" width="32" description="">
		<bitfield id="MAC_PRU1_1" width="16" begin="15" end="0" resetval="0x0" description="MAC pru1 DA5:DA4 Used for SAV and DA match" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_interface_0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_interface_0" offset="0x18" width="32" description="">
		<bitfield id="MAC_INF_0" width="32" begin="31" end="0" resetval="0x0" description="MAC Host interface DA3:DA0 Used for SAV and DA match" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_interface_1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_mac_interface_1" offset="0x1C" width="32" description="">
		<bitfield id="MAC_INF_1" width="16" begin="15" end="0" resetval="0x0" description="MAC Host interface DA5:DA4 Used for SAV and DA match" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_preempt_cfg" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_preempt_cfg" offset="0x20" width="32" description="">
		<bitfield id="SMD_R" width="8" begin="31" end="24" resetval="0x25" description="Response frame TAG " range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="SMD_V" width="8" begin="23" end="16" resetval="0x7" description="Verification frame TAG" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="EXP_SMD" width="8" begin="15" end="8" resetval="0x213" description="None preemptable frame start, or express frame  " range="15 - 8" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_smdt1s_cfg" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_smdt1s_cfg" offset="0x24" width="32" description="">
		<bitfield id="SMDT1S_3" width="8" begin="31" end="24" resetval="0x179" description="SMDT1S3 pattern" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="SMDT1S_2" width="8" begin="23" end="16" resetval="0x127" description="SMDT1S2 pattern" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="SMDT1S_1" width="8" begin="15" end="8" resetval="0x76" description="SMDT1S1 pattern" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="SMDT1S_0" width="8" begin="7" end="0" resetval="0x230" description="SMDT1S0 pattern" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_smdt1c_cfg" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_smdt1c_cfg" offset="0x28" width="32" description="">
		<bitfield id="SMDT1C_3" width="8" begin="31" end="24" resetval="0x42" description="SMDT1C3 pattern" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="SMDT1C_2" width="8" begin="23" end="16" resetval="0x158" description="SMDT1C2 pattern" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="SMDT1C_1" width="8" begin="15" end="8" resetval="0x82" description="SMDT1C1 pattern" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="SMDT1C_0" width="8" begin="7" end="0" resetval="0x97" description="SMDT1C0 pattern" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_frag_cnt_cfg" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_frag_cnt_cfg" offset="0x34" width="32" description="">
		<bitfield id="FRAG_CNT_3" width="8" begin="31" end="24" resetval="0x179" description="FRAG Cnt3 pattern" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="FRAG_CNT_2" width="8" begin="23" end="16" resetval="0x127" description="FRAG Cnt2 pattern" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="FRAG_CNT_1" width="8" begin="15" end="8" resetval="0x76" description="FRAG Cnt1 pattern" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="FRAG_CNT_0" width="8" begin="7" end="0" resetval="0x230" description="FRAG Cnt0 pattern" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_pa_stat_push0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_pa_stat_push0" offset="0x40" width="32" description="">
		<bitfield id="PA_STAT_PUSH3_0" width="8" begin="31" end="24" resetval="0x0" description="pa stat push3" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH2_0" width="8" begin="23" end="16" resetval="0x0" description="pa stat push2" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH1_0" width="8" begin="15" end="8" resetval="0x0" description="pa stat push1" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH0_0" width="8" begin="7" end="0" resetval="0x0" description="pa stat push0" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_pa_stat_push1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_pa_stat_push1" offset="0x44" width="32" description="">
		<bitfield id="PA_STAT_PUSH3_1" width="8" begin="31" end="24" resetval="0x0" description="pa stat push3" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH2_1" width="8" begin="23" end="16" resetval="0x0" description="pa stat push2" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH1_1" width="8" begin="15" end="8" resetval="0x0" description="pa stat push1" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH0_1" width="8" begin="7" end="0" resetval="0x0" description="pa stat push0" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_pa_stat_push2" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_pa_stat_push2" offset="0x48" width="32" description="">
		<bitfield id="PA_STAT_PUSH3_2" width="8" begin="31" end="24" resetval="0x0" description="pa stat push3" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH2_2" width="8" begin="23" end="16" resetval="0x0" description="pa stat push2" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH1_2" width="8" begin="15" end="8" resetval="0x0" description="pa stat push1" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PA_STAT_PUSH0_2" width="8" begin="7" end="0" resetval="0x0" description="pa stat push0" range="7 - 0" rwaccess="R/W"/>
	</register>
