IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class8_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class8_or_en_pru0" offset="0x450" width="32" description="">
		<bitfield id="RX_CLASS8_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class9_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class9_and_en_pru0" offset="0x454" width="32" description="">
		<bitfield id="RX_CLASS9_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class9_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class9_or_en_pru0" offset="0x458" width="32" description="">
		<bitfield id="RX_CLASS9_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class10_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class10_and_en_pru0" offset="0x45C" width="32" description="">
		<bitfield id="RX_CLASS10_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class10_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class10_or_en_pru0" offset="0x460" width="32" description="">
		<bitfield id="RX_CLASS10_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class11_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class11_and_en_pru0" offset="0x464" width="32" description="">
		<bitfield id="RX_CLASS11_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class11_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class11_or_en_pru0" offset="0x468" width="32" description="">
		<bitfield id="RX_CLASS11_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class12_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class12_and_en_pru0" offset="0x46C" width="32" description="">
		<bitfield id="RX_CLASS12_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class12_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class12_or_en_pru0" offset="0x470" width="32" description="">
		<bitfield id="RX_CLASS12_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class13_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class13_and_en_pru0" offset="0x474" width="32" description="">
		<bitfield id="RX_CLASS13_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class13_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class13_or_en_pru0" offset="0x478" width="32" description="">
		<bitfield id="RX_CLASS13_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class14_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class14_and_en_pru0" offset="0x47C" width="32" description="">
		<bitfield id="RX_CLASS14_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class14_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class14_or_en_pru0" offset="0x480" width="32" description="">
		<bitfield id="RX_CLASS14_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class15_and_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class15_and_en_pru0" offset="0x484" width="32" description="">
		<bitfield id="RX_CLASS15_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class15_or_en_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class15_or_en_pru0" offset="0x488" width="32" description="">
		<bitfield id="RX_CLASS15_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_cfg1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_cfg1_pru0" offset="0x48C" width="32" description="">
		<bitfield id="RX_CLASS15_SEL" width="2" begin="31" end="30" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="31 - 30" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS14_SEL" width="2" begin="29" end="28" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="29 - 28" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS13_SEL" width="2" begin="27" end="26" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="27 - 26" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS12_SEL" width="2" begin="25" end="24" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS11_SEL" width="2" begin="23" end="22" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="23 - 22" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS10_SEL" width="2" begin="21" end="20" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="21 - 20" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS9_SEL" width="2" begin="19" end="18" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="19 - 18" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS8_SEL" width="2" begin="17" end="16" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS7_SEL" width="2" begin="15" end="14" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS6_SEL" width="2" begin="13" end="12" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS5_SEL" width="2" begin="11" end="10" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS4_SEL" width="2" begin="9" end="8" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS3_SEL" width="2" begin="7" end="6" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS2_SEL" width="2" begin="5" end="4" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS1_SEL" width="2" begin="3" end="2" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS0_SEL" width="2" begin="1" end="0" resetval="0x0" description="rx class final term selection  00: OR 01: AND 10: OR AND AND OR 11: OR OR AND" range="1 - 0" rwaccess="R/W"/>
	</register>
