IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_cfg2_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_cfg2_pru0" offset="0x490" width="32" description="">
		<bitfield id="RX_CLASS_OR_NV" width="16" begin="31" end="16" resetval="0x0" description="rx class or nv enable   " range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_AND_NV" width="16" begin="15" end="0" resetval="0x0" description="rx class and nv enable   " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates0_pru0" offset="0x494" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN0" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK0" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK0" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK0" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL0" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates1_pru0" offset="0x498" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN1" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK1" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK1" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK1" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL1" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates2_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates2_pru0" offset="0x49C" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN2" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK2" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK2" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK2" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL2" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates3_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates3_pru0" offset="0x4A0" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN3" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK3" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK3" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK3" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL3" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates4_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates4_pru0" offset="0x4A4" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN4" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK4" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK4" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK4" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL4" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates5_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class_gates5_pru0" offset="0x4A8" width="32" description="">
		<bitfield id="RX_RED_PHASE_EN5" width="1" begin="8" end="8" resetval="0x0" description="red phase neable 0: disable 1: enable" range="8" rwaccess="R/W"/> 
		<bitfield id="RX_ALLOW_MASK5" width="1" begin="6" end="6" resetval="0x1" description="allow mask      0: unmask 1: mask" range="6" rwaccess="R/W"/> 
		<bitfield id="RX_CLASS_RAW_MASK5" width="1" begin="5" end="5" resetval="0x1" description="class raw mask  0: unmask 1: mask " range="5" rwaccess="R/W"/> 
		<bitfield id="RX_PHASE_MASK5" width="1" begin="4" end="4" resetval="0x1" description="time phase mask 0: unmask 1: mask " range="4" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_GATE_SEL5" width="3" begin="2" end="0" resetval="0x0" description="defines which rx_rate will gate rx_class " range="2 - 0" rwaccess="R/W"/>
	</register>
