IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_green_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_green_pru0" offset="0x4D4" width="32" description="">
		<bitfield id="RX_GREEN_VAL" width="1" begin="4" end="4" resetval="0x0" description="0 RED 1 GREEN status " range="4" rwaccess="R"/> 
		<bitfield id="RX_GREEN_CMP_SEL" width="4" begin="3" end="0" resetval="0x0" description="define which IEP CMP start green   " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_sa_hash_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_sa_hash_pru0" offset="0x4D8" width="32" description="">
		<bitfield id="SA_HASH_SEED" width="10" begin="9" end="0" resetval="0x0" description="SA Hash Seed" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_conn_hash_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_conn_hash_pru0" offset="0x4DC" width="32" description="">
		<bitfield id="CONN_HASH_SEED" width="10" begin="9" end="0" resetval="0x0" description="Connection Hash Seed" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_conn_hash_start_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_conn_hash_start_pru0" offset="0x4E0" width="32" description="">
		<bitfield id="CONN_HASH_START" width="15" begin="14" end="0" resetval="0x0" description="Connection Hash Start which 4 Bytes to hash" range="14 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg0_pru0" offset="0x4E4" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE0" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg1_pru0" offset="0x4E8" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE1" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg2_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg2_pru0" offset="0x4EC" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE2" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg3_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg3_pru0" offset="0x4F0" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE3" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg4_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg4_pru0" offset="0x4F4" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE4" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg5_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg5_pru0" offset="0x4F8" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE5" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg6_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg6_pru0" offset="0x4FC" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE6" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg7_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_cfg7_pru0" offset="0x500" width="32" description="">
		<bitfield id="RX_RATE_CIR_IDLE7" width="32" begin="31" end="0" resetval="0x0" description="RX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_src_sel0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_src_sel0_pru0" offset="0x504" width="32" description="">
		<bitfield id="RX_RATE_SRC_SEL3" width="6" begin="29" end="24" resetval="0x0" description="Map which filter/flag/class hit that rate logic uses, see table for mapping  " range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_SRC_SEL2" width="6" begin="21" end="16" resetval="0x0" description="Map which filter/flag/class hit that rate logic uses, see table for mapping  " range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_SRC_SEL1" width="6" begin="13" end="8" resetval="0x0" description="Map which filter/flag/class hit that rate logic uses, see table for mapping  " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_SRC_SEL0" width="6" begin="5" end="0" resetval="0x0" description="Map which filter/flag/class hit that rate logic uses, see table for mapping  " range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_src_sel1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_rate_src_sel1_pru0" offset="0x508" width="32" description="">
		<bitfield id="RX_RATE_SRC_SEL7" width="6" begin="29" end="24" resetval="0x0" description="Map which filter/flag/class hit that rate logic uses, see table for mapping  " range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_SRC_SEL6" width="6" begin="21" end="16" resetval="0x0" description="Map which filter/flag/class hit that rate logic uses, see table for mapping  " range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_SRC_SEL5" width="6" begin="13" end="8" resetval="0x0" description="Map which filter/flag/class hit that rate logic uses, see table for mapping  " range="13 - 8" rwaccess="R/W"/> 
		<bitfield id="RX_RATE_SRC_SEL4" width="6" begin="5" end="0" resetval="0x0" description="Map which filter/flag/class hit that rate logic uses, see table for mapping  " range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_0_pru0" offset="0x50C" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE0" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_0_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_0_pru0" offset="0x510" width="32" description="">
		<bitfield id="TX_RATE_ALLOW0" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN0" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN0" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
