IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_7_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg1_7_pru0" offset="0x544" width="32" description="">
		<bitfield id="TX_RATE_CIR_IDLE7" width="32" begin="31" end="0" resetval="0x0" description="TX Rate Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle including EOF.   The PIR counter is disabled with a zero value and packets will not be marked RED " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_7_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_tx_rate_cfg2_7_pru0" offset="0x548" width="32" description="">
		<bitfield id="TX_RATE_ALLOW7" width="1" begin="17" end="17" resetval="0x0" description="TX Rate Pkt Enable" range="17" rwaccess="R"/> 
		<bitfield id="TX_RATE_EN7" width="1" begin="16" end="16" resetval="0x0" description="TX Rate Pkt Enable" range="16" rwaccess="R/W"/> 
		<bitfield id="TX_RATE_LEN7" width="16" begin="15" end="0" resetval="0x0" description="TX Rate Pkt Length " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_good_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_good_pru0" offset="0x54C" width="32" description="">
		<bitfield id="RX_GOOD_FRM_CNT" width="32" begin="31" end="0" resetval="0x0" description="RX Good Frame Count Inc on none min err max err crc err odd err, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bc_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bc_pru0" offset="0x550" width="32" description="">
		<bitfield id="RX_BC_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX BC Frame Count Inc on BC type, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_mc_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_mc_pru0" offset="0x554" width="32" description="">
		<bitfield id="RX_MC_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX MC Frame Count Inc on MC type, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_crc_err_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_crc_err_pru0" offset="0x558" width="32" description="">
		<bitfield id="RX_CRC_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX CRC Err Frame Count Inc on crc err, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_mii_err_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_mii_err_pru0" offset="0x55C" width="32" description="">
		<bitfield id="RX_MII_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX MII Err Frame Count Inc on mii sgmii rgmii err, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_odd_err_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_odd_err_pru0" offset="0x560" width="32" description="">
		<bitfield id="RX_ODD_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX Odd Nibble Frame Count Inc on odd nibble mii, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_max_size_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_max_size_pru0" offset="0x564" width="32" description="">
		<bitfield id="RX_MAX_SIZE_FRM" width="16" begin="15" end="0" resetval="0x2000" description="RX MAX Size Frame Count Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_max_err_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_max_err_pru0" offset="0x568" width="32" description="">
		<bitfield id="RX_MAX_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX MAX Size Err Frame Count Inc if > than Limit, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_min_size_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_min_size_pru0" offset="0x56C" width="32" description="">
		<bitfield id="RX_MIN_SIZE_FRM" width="16" begin="15" end="0" resetval="0x64" description="RX MIN Size Frame Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_min_err_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_min_err_pru0" offset="0x570" width="32" description="">
		<bitfield id="RX_MIN_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX MIN Size Frame Count Inc if &#60; than limit, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_overrun_err_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_overrun_err_pru0" offset="0x574" width="32" description="">
		<bitfield id="RX_OVERRUN_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX L1 FIFO overflow Frame Count Inc on overflow event, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class0_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class0_hit_pru0" offset="0x578" width="32" description="">
		<bitfield id="RX_STAT_CLASS0_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class0 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class1_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class1_hit_pru0" offset="0x57C" width="32" description="">
		<bitfield id="RX_STAT_CLASS1_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class1 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class2_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class2_hit_pru0" offset="0x580" width="32" description="">
		<bitfield id="RX_STAT_CLASS2_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class2 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
