IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class3_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class3_hit_pru0" offset="0x584" width="32" description="">
		<bitfield id="RX_STAT_CLASS3_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class3 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class4_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class4_hit_pru0" offset="0x588" width="32" description="">
		<bitfield id="RX_STAT_CLASS4_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class4 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class5_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class5_hit_pru0" offset="0x58C" width="32" description="">
		<bitfield id="RX_STAT_CLASS5_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class5 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class6_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class6_hit_pru0" offset="0x590" width="32" description="">
		<bitfield id="RX_STAT_CLASS6_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class6 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class7_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class7_hit_pru0" offset="0x594" width="32" description="">
		<bitfield id="RX_STAT_CLASS7_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class7 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class8_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class8_hit_pru0" offset="0x598" width="32" description="">
		<bitfield id="RX_STAT_CLASS8_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class8 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class9_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class9_hit_pru0" offset="0x59C" width="32" description="">
		<bitfield id="RX_STAT_CLASS9_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class9 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class10_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class10_hit_pru0" offset="0x5A0" width="32" description="">
		<bitfield id="RX_STAT_CLASS10_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class10 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class11_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class11_hit_pru0" offset="0x5A4" width="32" description="">
		<bitfield id="RX_STAT_CLASS11_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class11 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class12_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class12_hit_pru0" offset="0x5A8" width="32" description="">
		<bitfield id="RX_STAT_CLASS12_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class12 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class13_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class13_hit_pru0" offset="0x5AC" width="32" description="">
		<bitfield id="RX_STAT_CLASS13_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class13 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class14_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class14_hit_pru0" offset="0x5B0" width="32" description="">
		<bitfield id="RX_STAT_CLASS14_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class14 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class15_hit_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class15_hit_pru0" offset="0x5B4" width="32" description="">
		<bitfield id="RX_STAT_CLASS15_PRU0" width="32" begin="31" end="0" resetval="0x0" description="RX Class15 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_smd_frag_err_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_smd_frag_err_pru0" offset="0x5B8" width="32" description="">
		<bitfield id="RX_STAT_SMD_ERR_PRU0" width="8" begin="31" end="24" resetval="0x0" description="RX SMDS Error Count, Inc when first none 0x55 does not match any valid SMD, Wrt subtracts" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="RX_STAT_FRAG_ERR_PRU0" width="8" begin="23" end="16" resetval="0x0" description="RX Frag_Cnt Seq Error Count, Wrt subtracts" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_STAT_SMDC_ERR_PRU0" width="8" begin="15" end="8" resetval="0x0" description="RX SMDCx Seq Error Count, Wrt subtracts" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="RX_STAT_SMDS_ERR_PRU0" width="8" begin="7" end="0" resetval="0x0" description="RX SMDSx Seq Error Count, Wrt subtracts" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt1_size_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt1_size_pru0" offset="0x5BC" width="32" description="">
		<bitfield id="RX_STAT_BKT1_SIZE" width="14" begin="13" end="0" resetval="0x64" description="RX Bucket1 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt2_size_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt2_size_pru0" offset="0x5C0" width="32" description="">
		<bitfield id="RX_STAT_BKT2_SIZE" width="14" begin="13" end="0" resetval="0x128" description="RX Bucket2 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt3_size_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt3_size_pru0" offset="0x5C4" width="32" description="">
		<bitfield id="RX_STAT_BKT3_SIZE" width="14" begin="13" end="0" resetval="0x256" description="RX Bucket3 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt4_size_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt4_size_pru0" offset="0x5C8" width="32" description="">
		<bitfield id="RX_STAT_BKT4_SIZE" width="14" begin="13" end="0" resetval="0x512" description="RX Bucket4 Byte Size" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_64_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_64_pru0" offset="0x5CC" width="32" description="">
		<bitfield id="RX_64_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX 64Byte Frame Count Inc if 64B size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt1_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt1_pru0" offset="0x5D0" width="32" description="">
		<bitfield id="RX_STAT_BKT1" width="16" begin="15" end="0" resetval="0x0" description="RX Bucket1 Frame Count Inc if &#60;= than Bucket1 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt2_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt2_pru0" offset="0x5D4" width="32" description="">
		<bitfield id="RX_STAT_BKT2" width="16" begin="15" end="0" resetval="0x0" description="RX Bucket2 Frame Count Inc if &#60;= than Bucket2 Byte Size and if > than Bucket1 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt3_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt3_pru0" offset="0x5D8" width="32" description="">
		<bitfield id="RX_STAT_BKT3" width="16" begin="15" end="0" resetval="0x0" description="RX Bucket3 Frame Count Inc if &#60;= than Bucket3 Byte Size and if > than Bucket2 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt4_pru0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_bkt4_pru0" offset="0x5DC" width="32" description="">
		<bitfield id="RX_STAT_BKT4" width="16" begin="15" end="0" resetval="0x0" description="RX Bucket4 Frame Count Inc if &#60;= than Bucket4 Byte Size and if > than Bucket3 Byte Size" range="15 - 0" rwaccess="R/W"/>
	</register>
