IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p_mask0_pru1" offset="0x93C" width="32" description="">
		<bitfield id="FT3_6_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_6_p_mask1_pru1" offset="0x940" width="32" description="">
		<bitfield id="FT3_6_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p0_pru1" offset="0x944" width="32" description="">
		<bitfield id="FT3_7_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p1_pru1" offset="0x948" width="32" description="">
		<bitfield id="FT3_7_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p_mask0_pru1" offset="0x94C" width="32" description="">
		<bitfield id="FT3_7_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_7_p_mask1_pru1" offset="0x950" width="32" description="">
		<bitfield id="FT3_7_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p0_pru1" offset="0x954" width="32" description="">
		<bitfield id="FT3_8_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p1_pru1" offset="0x958" width="32" description="">
		<bitfield id="FT3_8_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p_mask0_pru1" offset="0x95C" width="32" description="">
		<bitfield id="FT3_8_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_8_p_mask1_pru1" offset="0x960" width="32" description="">
		<bitfield id="FT3_8_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p0_pru1" offset="0x964" width="32" description="">
		<bitfield id="FT3_9_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p1_pru1" offset="0x968" width="32" description="">
		<bitfield id="FT3_9_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p_mask0_pru1" offset="0x96C" width="32" description="">
		<bitfield id="FT3_9_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_9_p_mask1_pru1" offset="0x970" width="32" description="">
		<bitfield id="FT3_9_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p0_pru1" offset="0x974" width="32" description="">
		<bitfield id="FT3_10_P0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P4:P1  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p1_pru1" offset="0x978" width="32" description="">
		<bitfield id="FT3_10_P1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 P8:P5  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p_mask0_pru1" offset="0x97C" width="32" description="">
		<bitfield id="FT3_10_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_10_p_mask1_pru1" offset="0x980" width="32" description="">
		<bitfield id="FT3_10_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
