IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p_mask0_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p_mask0_pru1" offset="0x9CC" width="32" description="">
		<bitfield id="FT3_15_P_MASK0" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP4:MP1    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p_mask1_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft3_15_p_mask1_pru1" offset="0x9D0" width="32" description="">
		<bitfield id="FT3_15_P_MASK1" width="32" begin="31" end="0" resetval="0x0" description="Filter3 MP8:MP5    set to 1 to mask that bit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft_rx_ptr_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_ft_rx_ptr_pru1" offset="0x9D4" width="32" description="">
		<bitfield id="FT_RX_PTR_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX current filter Byte Count  " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class0_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class0_and_en_pru1" offset="0x9D8" width="32" description="">
		<bitfield id="RX_CLASS0_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class0_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class0_or_en_pru1" offset="0x9DC" width="32" description="">
		<bitfield id="RX_CLASS0_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class1_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class1_and_en_pru1" offset="0x9E0" width="32" description="">
		<bitfield id="RX_CLASS1_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class1_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class1_or_en_pru1" offset="0x9E4" width="32" description="">
		<bitfield id="RX_CLASS1_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class2_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class2_and_en_pru1" offset="0x9E8" width="32" description="">
		<bitfield id="RX_CLASS2_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class2_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class2_or_en_pru1" offset="0x9EC" width="32" description="">
		<bitfield id="RX_CLASS2_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class3_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class3_and_en_pru1" offset="0x9F0" width="32" description="">
		<bitfield id="RX_CLASS3_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class3_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class3_or_en_pru1" offset="0x9F4" width="32" description="">
		<bitfield id="RX_CLASS3_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class4_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class4_and_en_pru1" offset="0x9F8" width="32" description="">
		<bitfield id="RX_CLASS4_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class4_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class4_or_en_pru1" offset="0x9FC" width="32" description="">
		<bitfield id="RX_CLASS4_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class5_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class5_and_en_pru1" offset="0xA00" width="32" description="">
		<bitfield id="RX_CLASS5_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class5_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class5_or_en_pru1" offset="0xA04" width="32" description="">
		<bitfield id="RX_CLASS5_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class6_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class6_and_en_pru1" offset="0xA08" width="32" description="">
		<bitfield id="RX_CLASS6_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class6_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class6_or_en_pru1" offset="0xA0C" width="32" description="">
		<bitfield id="RX_CLASS6_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class7_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class7_and_en_pru1" offset="0xA10" width="32" description="">
		<bitfield id="RX_CLASS7_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class7_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class7_or_en_pru1" offset="0xA14" width="32" description="">
		<bitfield id="RX_CLASS7_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class8_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class8_and_en_pru1" offset="0xA18" width="32" description="">
		<bitfield id="RX_CLASS8_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class8_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class8_or_en_pru1" offset="0xA1C" width="32" description="">
		<bitfield id="RX_CLASS8_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class9_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class9_and_en_pru1" offset="0xA20" width="32" description="">
		<bitfield id="RX_CLASS9_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class9_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class9_or_en_pru1" offset="0xA24" width="32" description="">
		<bitfield id="RX_CLASS9_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class10_and_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class10_and_en_pru1" offset="0xA28" width="32" description="">
		<bitfield id="RX_CLASS10_AND_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class and enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class10_or_en_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_class10_or_en_pru1" offset="0xA2C" width="32" description="">
		<bitfield id="RX_CLASS10_OR_EN" width="32" begin="31" end="0" resetval="0x0" description="rx class or enabels   " range="31 - 0" rwaccess="R/W"/>
	</register>
