IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_mii_err_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_mii_err_pru1" offset="0xB28" width="32" description="">
		<bitfield id="RX_MII_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX MII Err Frame Count Inc on mii sgmii rgmii err, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_odd_err_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_odd_err_pru1" offset="0xB2C" width="32" description="">
		<bitfield id="RX_ODD_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX Odd Nibble Frame Count Inc on odd nibble mii, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_max_size_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_max_size_pru1" offset="0xB30" width="32" description="">
		<bitfield id="RX_MAX_SIZE_FRM" width="16" begin="15" end="0" resetval="0x2000" description="RX MAX Size Frame Count Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_max_err_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_max_err_pru1" offset="0xB34" width="32" description="">
		<bitfield id="RX_MAX_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX MAX Size Err Frame Count Inc if > than Limit, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_min_size_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_min_size_pru1" offset="0xB38" width="32" description="">
		<bitfield id="RX_MIN_SIZE_FRM" width="16" begin="15" end="0" resetval="0x64" description="RX MIN Size Frame Limit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_min_err_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_min_err_pru1" offset="0xB3C" width="32" description="">
		<bitfield id="RX_MIN_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX MIN Size Frame Count Inc if &#60; than limit, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_overrun_err_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_overrun_err_pru1" offset="0xB40" width="32" description="">
		<bitfield id="RX_OVERRUN_ERR_FRM_CNT" width="16" begin="15" end="0" resetval="0x0" description="RX L1 FIFO overflow Frame Count Inc on overflow event, Wrt subtracts" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class0_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class0_hit_pru1" offset="0xB44" width="32" description="">
		<bitfield id="RX_STAT_CLASS0_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class0 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class1_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class1_hit_pru1" offset="0xB48" width="32" description="">
		<bitfield id="RX_STAT_CLASS1_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class1 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class2_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class2_hit_pru1" offset="0xB4C" width="32" description="">
		<bitfield id="RX_STAT_CLASS2_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class2 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class3_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class3_hit_pru1" offset="0xB50" width="32" description="">
		<bitfield id="RX_STAT_CLASS3_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class3 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class4_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class4_hit_pru1" offset="0xB54" width="32" description="">
		<bitfield id="RX_STAT_CLASS4_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class4 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class5_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class5_hit_pru1" offset="0xB58" width="32" description="">
		<bitfield id="RX_STAT_CLASS5_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class5 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class6_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class6_hit_pru1" offset="0xB5C" width="32" description="">
		<bitfield id="RX_STAT_CLASS6_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class6 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class7_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class7_hit_pru1" offset="0xB60" width="32" description="">
		<bitfield id="RX_STAT_CLASS7_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class7 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class8_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class8_hit_pru1" offset="0xB64" width="32" description="">
		<bitfield id="RX_STAT_CLASS8_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class8 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class9_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class9_hit_pru1" offset="0xB68" width="32" description="">
		<bitfield id="RX_STAT_CLASS9_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class9 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class10_hit_pru1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_rx_stat_class10_hit_pru1" offset="0xB6C" width="32" description="">
		<bitfield id="RX_STAT_CLASS10_PRU1" width="32" begin="31" end="0" resetval="0x0" description="RX Class10 Hit Count, Wrt subtracts" range="31 - 0" rwaccess="R/W"/>
	</register>
