IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue4" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue4" offset="0xD10" width="32" description="">
		<bitfield id="QUEUE_H_PTR4" width="16" begin="15" end="0" resetval="0x0" description="Queue 4" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue5" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue5" offset="0xD14" width="32" description="">
		<bitfield id="QUEUE_H_PTR5" width="16" begin="15" end="0" resetval="0x0" description="Queue 5" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue6" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue6" offset="0xD18" width="32" description="">
		<bitfield id="QUEUE_H_PTR6" width="16" begin="15" end="0" resetval="0x0" description="Queue 6" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue7" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue7" offset="0xD1C" width="32" description="">
		<bitfield id="QUEUE_H_PTR7" width="16" begin="15" end="0" resetval="0x0" description="Queue 7" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue8" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue8" offset="0xD20" width="32" description="">
		<bitfield id="QUEUE_H_PTR8" width="16" begin="15" end="0" resetval="0x0" description="Queue 8" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue9" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue9" offset="0xD24" width="32" description="">
		<bitfield id="QUEUE_H_PTR9" width="16" begin="15" end="0" resetval="0x0" description="Queue 9" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue10" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue10" offset="0xD28" width="32" description="">
		<bitfield id="QUEUE_H_PTR10" width="16" begin="15" end="0" resetval="0x0" description="Queue 10" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue11" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue11" offset="0xD2C" width="32" description="">
		<bitfield id="QUEUE_H_PTR11" width="16" begin="15" end="0" resetval="0x0" description="Queue 11" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue12" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue12" offset="0xD30" width="32" description="">
		<bitfield id="QUEUE_H_PTR12" width="16" begin="15" end="0" resetval="0x0" description="Queue 12" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue13" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue13" offset="0xD34" width="32" description="">
		<bitfield id="QUEUE_H_PTR13" width="16" begin="15" end="0" resetval="0x0" description="Queue 13" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue14" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue14" offset="0xD38" width="32" description="">
		<bitfield id="QUEUE_H_PTR14" width="16" begin="15" end="0" resetval="0x0" description="Queue 14" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue15" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue15" offset="0xD3C" width="32" description="">
		<bitfield id="QUEUE_H_PTR15" width="16" begin="15" end="0" resetval="0x0" description="Queue 15" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue16" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue16" offset="0xD40" width="32" description="">
		<bitfield id="QUEUE_H_PTR16" width="16" begin="15" end="0" resetval="0x0" description="Queue 16" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue17" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue17" offset="0xD44" width="32" description="">
		<bitfield id="QUEUE_H_PTR17" width="16" begin="15" end="0" resetval="0x0" description="Queue 17" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue18" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue18" offset="0xD48" width="32" description="">
		<bitfield id="QUEUE_H_PTR18" width="16" begin="15" end="0" resetval="0x0" description="Queue 18" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue19" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue19" offset="0xD4C" width="32" description="">
		<bitfield id="QUEUE_H_PTR19" width="16" begin="15" end="0" resetval="0x0" description="Queue 19" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue20" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue20" offset="0xD50" width="32" description="">
		<bitfield id="QUEUE_H_PTR20" width="16" begin="15" end="0" resetval="0x0" description="Queue 20" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue21" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue21" offset="0xD54" width="32" description="">
		<bitfield id="QUEUE_H_PTR21" width="16" begin="15" end="0" resetval="0x0" description="Queue 21" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue22" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue22" offset="0xD58" width="32" description="">
		<bitfield id="QUEUE_H_PTR22" width="16" begin="15" end="0" resetval="0x0" description="Queue 22" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue23" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue23" offset="0xD5C" width="32" description="">
		<bitfield id="QUEUE_H_PTR23" width="16" begin="15" end="0" resetval="0x0" description="Queue 23" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue24" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue24" offset="0xD60" width="32" description="">
		<bitfield id="QUEUE_H_PTR24" width="16" begin="15" end="0" resetval="0x0" description="Queue 24" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue25" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue25" offset="0xD64" width="32" description="">
		<bitfield id="QUEUE_H_PTR25" width="16" begin="15" end="0" resetval="0x0" description="Queue 25" range="15 - 0" rwaccess="R/W"/>
	</register>
