IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue26" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue26" offset="0xD68" width="32" description="">
		<bitfield id="QUEUE_H_PTR26" width="16" begin="15" end="0" resetval="0x0" description="Queue 26" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue27" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue27" offset="0xD6C" width="32" description="">
		<bitfield id="QUEUE_H_PTR27" width="16" begin="15" end="0" resetval="0x0" description="Queue 27" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue28" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue28" offset="0xD70" width="32" description="">
		<bitfield id="QUEUE_H_PTR28" width="16" begin="15" end="0" resetval="0x0" description="Queue 28" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue29" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue29" offset="0xD74" width="32" description="">
		<bitfield id="QUEUE_H_PTR29" width="16" begin="15" end="0" resetval="0x0" description="Queue 29" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue30" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue30" offset="0xD78" width="32" description="">
		<bitfield id="QUEUE_H_PTR30" width="16" begin="15" end="0" resetval="0x0" description="Queue 30" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue31" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue31" offset="0xD7C" width="32" description="">
		<bitfield id="QUEUE_H_PTR31" width="16" begin="15" end="0" resetval="0x0" description="Queue 31" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue32" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue32" offset="0xD80" width="32" description="">
		<bitfield id="QUEUE_H_PTR32" width="16" begin="15" end="0" resetval="0x0" description="Queue 32" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue33" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue33" offset="0xD84" width="32" description="">
		<bitfield id="QUEUE_H_PTR33" width="16" begin="15" end="0" resetval="0x0" description="Queue 33" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue34" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue34" offset="0xD88" width="32" description="">
		<bitfield id="QUEUE_H_PTR34" width="16" begin="15" end="0" resetval="0x0" description="Queue 34" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue35" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue35" offset="0xD8C" width="32" description="">
		<bitfield id="QUEUE_H_PTR35" width="16" begin="15" end="0" resetval="0x0" description="Queue 35" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue36" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue36" offset="0xD90" width="32" description="">
		<bitfield id="QUEUE_H_PTR36" width="16" begin="15" end="0" resetval="0x0" description="Queue 36" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue37" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue37" offset="0xD94" width="32" description="">
		<bitfield id="QUEUE_H_PTR37" width="16" begin="15" end="0" resetval="0x0" description="Queue 37" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue38" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue38" offset="0xD98" width="32" description="">
		<bitfield id="QUEUE_H_PTR38" width="16" begin="15" end="0" resetval="0x0" description="Queue 38" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue39" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue39" offset="0xD9C" width="32" description="">
		<bitfield id="QUEUE_H_PTR39" width="16" begin="15" end="0" resetval="0x0" description="Queue 39" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue40" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue40" offset="0xDA0" width="32" description="">
		<bitfield id="QUEUE_H_PTR40" width="16" begin="15" end="0" resetval="0x0" description="Queue 40" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue41" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue41" offset="0xDA4" width="32" description="">
		<bitfield id="QUEUE_H_PTR41" width="16" begin="15" end="0" resetval="0x0" description="Queue 41" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue42" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue42" offset="0xDA8" width="32" description="">
		<bitfield id="QUEUE_H_PTR42" width="16" begin="15" end="0" resetval="0x0" description="Queue 42" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue43" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue43" offset="0xDAC" width="32" description="">
		<bitfield id="QUEUE_H_PTR43" width="16" begin="15" end="0" resetval="0x0" description="Queue 43" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue44" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue44" offset="0xDB0" width="32" description="">
		<bitfield id="QUEUE_H_PTR44" width="16" begin="15" end="0" resetval="0x0" description="Queue 44" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue45" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue45" offset="0xDB4" width="32" description="">
		<bitfield id="QUEUE_H_PTR45" width="16" begin="15" end="0" resetval="0x0" description="Queue 45" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue46" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue46" offset="0xDB8" width="32" description="">
		<bitfield id="QUEUE_H_PTR46" width="16" begin="15" end="0" resetval="0x0" description="Queue 46" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue47" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue47" offset="0xDBC" width="32" description="">
		<bitfield id="QUEUE_H_PTR47" width="16" begin="15" end="0" resetval="0x0" description="Queue 47" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue48" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue48" offset="0xDC0" width="32" description="">
		<bitfield id="QUEUE_H_PTR48" width="16" begin="15" end="0" resetval="0x0" description="Queue 48" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue49" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue49" offset="0xDC4" width="32" description="">
		<bitfield id="QUEUE_H_PTR49" width="16" begin="15" end="0" resetval="0x0" description="Queue 49" range="15 - 0" rwaccess="R/W"/>
	</register>
