IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue50" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue50" offset="0xDC8" width="32" description="">
		<bitfield id="QUEUE_H_PTR50" width="16" begin="15" end="0" resetval="0x0" description="Queue 50" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue51" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue51" offset="0xDCC" width="32" description="">
		<bitfield id="QUEUE_H_PTR51" width="16" begin="15" end="0" resetval="0x0" description="Queue 51" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue52" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue52" offset="0xDD0" width="32" description="">
		<bitfield id="QUEUE_H_PTR52" width="16" begin="15" end="0" resetval="0x0" description="Queue 52" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue53" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue53" offset="0xDD4" width="32" description="">
		<bitfield id="QUEUE_H_PTR53" width="16" begin="15" end="0" resetval="0x0" description="Queue 53" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue54" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue54" offset="0xDD8" width="32" description="">
		<bitfield id="QUEUE_H_PTR54" width="16" begin="15" end="0" resetval="0x0" description="Queue 54" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue55" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue55" offset="0xDDC" width="32" description="">
		<bitfield id="QUEUE_H_PTR55" width="16" begin="15" end="0" resetval="0x0" description="Queue 55" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue56" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue56" offset="0xDE0" width="32" description="">
		<bitfield id="QUEUE_H_PTR56" width="16" begin="15" end="0" resetval="0x0" description="Queue 56" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue57" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue57" offset="0xDE4" width="32" description="">
		<bitfield id="QUEUE_H_PTR57" width="16" begin="15" end="0" resetval="0x0" description="Queue 57" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue58" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue58" offset="0xDE8" width="32" description="">
		<bitfield id="QUEUE_H_PTR58" width="16" begin="15" end="0" resetval="0x0" description="Queue 58" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue59" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue59" offset="0xDEC" width="32" description="">
		<bitfield id="QUEUE_H_PTR59" width="16" begin="15" end="0" resetval="0x0" description="Queue 59" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue60" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue60" offset="0xDF0" width="32" description="">
		<bitfield id="QUEUE_H_PTR60" width="16" begin="15" end="0" resetval="0x0" description="Queue 60" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue61" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue61" offset="0xDF4" width="32" description="">
		<bitfield id="QUEUE_H_PTR61" width="16" begin="15" end="0" resetval="0x0" description="Queue 61" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue62" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue62" offset="0xDF8" width="32" description="">
		<bitfield id="QUEUE_H_PTR62" width="16" begin="15" end="0" resetval="0x0" description="Queue 62" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue63" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue63" offset="0xDFC" width="32" description="">
		<bitfield id="QUEUE_H_PTR63" width="16" begin="15" end="0" resetval="0x0" description="Queue 63" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek0" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek0" offset="0xE00" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR0" width="16" begin="15" end="0" resetval="0x0" description="Queue 0 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek1" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek1" offset="0xE04" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR1" width="16" begin="15" end="0" resetval="0x0" description="Queue 1 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek2" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek2" offset="0xE08" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR2" width="16" begin="15" end="0" resetval="0x0" description="Queue 2 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek3" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek3" offset="0xE0C" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR3" width="16" begin="15" end="0" resetval="0x0" description="Queue 3 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek4" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek4" offset="0xE10" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR4" width="16" begin="15" end="0" resetval="0x0" description="Queue 4 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek5" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek5" offset="0xE14" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR5" width="16" begin="15" end="0" resetval="0x0" description="Queue 5 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek6" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek6" offset="0xE18" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR6" width="16" begin="15" end="0" resetval="0x0" description="Queue 6 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek7" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek7" offset="0xE1C" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR7" width="16" begin="15" end="0" resetval="0x0" description="Queue 7 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek8" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek8" offset="0xE20" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR8" width="16" begin="15" end="0" resetval="0x0" description="Queue 8 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek9" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek9" offset="0xE24" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR9" width="16" begin="15" end="0" resetval="0x0" description="Queue 9 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek10" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek10" offset="0xE28" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR10" width="16" begin="15" end="0" resetval="0x0" description="Queue 10 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek11" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek11" offset="0xE2C" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR11" width="16" begin="15" end="0" resetval="0x0" description="Queue 11 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek12" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_peek12" offset="0xE30" width="32" description="">
		<bitfield id="QUEUE_H_PEEK_PTR12" width="16" begin="15" end="0" resetval="0x0" description="Queue 12 Peek portal" range="15 - 0" rwaccess="R"/>
	</register>
