IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt16" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt16" offset="0xE80" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_16" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count16" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt17" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt17" offset="0xE84" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_17" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count17" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt18" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt18" offset="0xE88" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_18" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count18" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt19" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt19" offset="0xE8C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_19" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count19" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt20" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt20" offset="0xE90" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_20" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count20" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt21" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt21" offset="0xE94" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_21" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count21" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt22" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt22" offset="0xE98" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_22" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count22" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt23" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt23" offset="0xE9C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_23" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count23" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt24" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt24" offset="0xEA0" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_24" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count24" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt25" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt25" offset="0xEA4" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_25" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count25" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt26" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt26" offset="0xEA8" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_26" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count26" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt27" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt27" offset="0xEAC" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_27" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count27" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt28" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt28" offset="0xEB0" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_28" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count28" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt29" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt29" offset="0xEB4" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_29" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count29" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt30" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt30" offset="0xEB8" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_30" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count30" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt31" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt31" offset="0xEBC" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_31" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count31" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt32" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt32" offset="0xEC0" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_32" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count32" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt33" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt33" offset="0xEC4" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_33" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count33" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt34" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt34" offset="0xEC8" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_34" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count34" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt35" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt35" offset="0xECC" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_35" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count35" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt36" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt36" offset="0xED0" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_36" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count36" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt37" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt37" offset="0xED4" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_37" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count37" range="15 - 0" rwaccess="R"/>
	</register>
