IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_MII_RT_PR1_MII_RT_G_CFG_REGS_G.xml
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt58" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt58" offset="0xF28" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_58" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count58" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt59" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt59" offset="0xF2C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_59" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count59" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt60" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt60" offset="0xF30" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_60" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count60" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt61" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt61" offset="0xF34" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_61" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count61" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt62" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt62" offset="0xF38" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_62" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count62" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt63" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_cnt63" offset="0xF3C" width="32" description="">
		<bitfield id="QUEUE_CNT_ENTRIES_63" width="16" begin="15" end="0" resetval="0x0" description="Queue Entry Count63" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_reset" acronym="PR1_MII_RT__PR1_MII_RT_G_CFG__REGS_G_queue_reset" offset="0xF40" width="32" description="">
		<bitfield id="RESET_QUEUE_ID" width="6" begin="5" end="0" resetval="0x0" description="Reset Queue ID" range="5 - 0" rwaccess="R/W"/>
	</register>
</module>